OpenFOAM/simpleFsi-OF4.1/cases/test-laminar-halfcyl-3DoF/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solver          displacementLaplacian;
//solver          displacementSBRStress;


displacementLaplacianCoeffs
{
    diffusivity     quadratic inverseDistance 1(cylinder);
    applyPointLocation false;
}


displacementSBRStressCoeffs
{
    diffusivity     quadratic inverseDistance 1(cylinder);
    applyPointLocation false;
}
        

// ************************************************************************* //
